# LAB MONGO M2

In [1]:
from pymongo import MongoClient
import pymongo
import pandas as pd

## To do:

Queries:
1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.
2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.
3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.
4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.
5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.
6. All the companies that don't include the partners field.
7. All the companies that have a null type of value on the category_code field.
8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.
9. Order all the companies by their IPO price descendently.
10. Retrieve the 10 companies with more employees, order by the number of employees
11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.
13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000
14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.

### First Step: Connect to our database

In [2]:
client = MongoClient("mongodb://admin:admin@localhost:32773")
db = client.mybbdd

### Q1: Companies with Babelgum as Name

In [3]:
q1=db.docs.find({"name":{"$eq":"Babelgum"}}, { "name": 1 , "_id": 0})[0]
print('Number of companies: ',len(q1))
print(q1)

Number of companies:  1
{'name': 'Babelgum'}

### Q2: Num of employees over 500, limit it to 20 results and sort by number of employees

In [4]:
q2= db.docs.find({"number_of_employees":{"$gt":5000}}, 
                 limit=20,
                 projection={"name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees',-1)
df2 = pd.DataFrame(list(q2))
display(df2)

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

### Q3: All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds

In [5]:
q3= db.docs.find({"founded_year": { "$lte": 2005,"$gte": 2000}},
                projection={ "name": 1 , "founded_year": 1, "_id": 0})
df3 = pd.DataFrame(list(q3))
print('Number of companies founded between 2000 and 2005: ',len(df3))
display(df3.head())

Number of companies founded between 2000 and 2005:  3734

   founded_year       name
0          2005   Wetpaint
1          2005       Zoho
2          2005  Omnidrive
3          2004       Digg
4          2003     Gizmoz

### Q4: All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.

In [6]:
q4= db.docs.find({"$and":[{"founded_year": {"$lte": 2010}},{"ipo.valuation_amount":{"$gte":100000000}}]},
                projection={ "name": 1 , "ipo.valuation_amount": 1, "_id": 0})
df4 = pd.DataFrame(list(q4))
print('Number of companies founded before 2010: ',len(df4))
display(df4.head())

Number of companies founded before 2010:  42

                                  ipo        name
0   {'valuation_amount': 18100000000}     Twitter
1  {'valuation_amount': 104000000000}    Facebook
2    {'valuation_amount': 1300000000}        Yelp
3    {'valuation_amount': 9310000000}    LinkedIn
4     {'valuation_amount': 290000000}  Brightcove

### Q5: All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [7]:
q5= db.docs.find({"founded_year": { "$lte": 2005},"number_of_employees":{"$gte":1000}},
                 limit=10,
                 projection={ "name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING)
df5 = pd.DataFrame(list(q5))
display(df5)

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

### Q6: All the companies that don't include the partners field.

In [8]:
q6= db.docs.find({"partners":{"$exists":False}},
                 projection={ "name": 1 ,"_id": 0})
df6 = pd.DataFrame(list(q6))
display(df6.head())
print('Number of registers found: ',len(df6))

Empty DataFrame
Columns: []
Index: []

Number of registers found:  0

### Q7: All the companies that have a null type of value on the category_code field.

In [9]:
q7= db.docs.find({"category_code":{"$type":'null'}},
                 projection={ "name": 1 ,"_id": 0})
df7 = pd.DataFrame(list(q7))
display(df7.head())
print('Number of registers found: ',len(df7))

           name
0    Collective
1       Snimmer
2        KoolIM
3  Level9 Media
4       VidKing

Number of registers found:  2751

### Q8: All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.

In [10]:
q8= db.docs.find({"number_of_employees":{"$gte":100,"$lt":1000}}, 
                 limit=20,
                 projection={"name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees',-1)
df8 = pd.DataFrame(list(q8))
print('Number of registers: ',len(df8))
display(df8.head())

Number of registers:  20

                              name  number_of_employees
0                      Datamonitor                  984
1             Infinera Corporation                  974
2                              Box                  950
3  NorthPoint Communications Group                  948
4                     888 Holdings                  931

### Q9: Order all the companies by their IPO price descendently.

In [11]:
q9= db.docs.find({"$and":[{"ipo.price":{"$ne":None}},
                          {"ipo.price":{"$exists":True}}]},
                 projection={"name": 1,"ipo.price":1 ,"_id": 0}).sort('ipo.price',-1)
df9 = pd.DataFrame(list(q9))
print('Number of registers: ',len(df9))
display(df9.head())

Number of registers:  0

Empty DataFrame
Columns: []
Index: []

# NO IPO PRICE FOUND

### Q10: Retrieve the 10 companies with more employees, order by the number of employees

In [12]:
q10= db.docs.find(projection={"name": 1,
                              "number_of_employees":1,
                              "_id": 0}).sort('number_of_employees',-1).limit(20)
df10 = pd.DataFrame(list(q10))
print('Number of registers: ',len(df10))
display(df10.head())

Number of registers:  20

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000

### Q11: All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [13]:
q11= db.docs.find({"founded_month":{"$gt":6}},
                  projection={"name": 1,
                              "founded_month":1,
                              "founded_year":1,
                              "_id": 0}).sort('number_of_employees',-1).limit(1000)
df11 = pd.DataFrame(list(q11))
print('Number of registers: ',len(df11))
display(df11.head())

Number of registers:  1000

   founded_month  founded_year                     name
0             12          1998                   PayPal
1             11          1999               ExxonMobil
2              9          1998                   Google
3              8          1982              kalimatapla
4             10          1923  The Walt Disney Company

### Q13: All the companies founded before 2000 that have and acquisition amount of more than 10.000.000

In [14]:
q13= db.docs.find({"$and":[{"founded_year":{"$lt":2000}},
                          {"acquisition.price_amount":{"$gte":10000000}}]},
                  projection={"name": 1,
                              "founded_year":1,
                              "acquisition.price_amount":1,
                              "_id": 0})
df13 = pd.DataFrame(list(q13))
print('Number of registers: ',len(df13))
display(df13.head())

Number of registers:  209

                    acquisition  founded_year        name
0   {'price_amount': 625000000}          1999     Postini
1   {'price_amount': 180000000}          1999    SideStep
2    {'price_amount': 25000000}          1999  Recipezaar
3  {'price_amount': 1500000000}          1998      PayPal
4   {'price_amount': 300000000}          1999    Snapfish

### Q14: All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their name and acquisiton field.

In [15]:
q14= db.docs.find({"acquisition.acquired_year":{"$gte":2015}},
                  projection={"name": 1,
                              "acquisition":1,
                              "_id": 0}).sort('acquisition.price_amount',1)
df14 = pd.DataFrame(list(q14))
print('Number of registers: ',len(df14))
display(df14.head())

Number of registers:  0

Empty DataFrame
Columns: []
Index: []

___